<a href="https://colab.research.google.com/github/Swapn2/Data-Science-Learnings/blob/main/panda_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

https://pandas.pydata.org/about/index.html

### Pandas Series

A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

In [3]:
import pandas as pd
import numpy as np

## series from the list

In [5]:
country = ['India',"pakistan",'srilanka','Nepal','japan']
pd.Series(country)

0       India
1    pakistan
2    srilanka
3       Nepal
4       japan
dtype: object

In [23]:
# integer
runs = [13,52,85,56,32,]
run_series = pd.Series(runs)

In [9]:
# custom index
marks = [13,52,85,56]
subject = ['hindi','english','maths','science']

pd.Series(marks,index=subject)

hindi      13
english    52
maths      85
science    56
dtype: int64

In [12]:
# setting name
# custom index
marks = [13,52,85,56]
subject = ['hindi','english','maths','science']

my_marks = pd.Series(marks,index=subject,name = 'Marks')

In [13]:
my_marks

hindi      13
english    52
maths      85
science    56
Name: Marks, dtype: int64

## series from the dictionary

In [15]:
marks = {'maths':65,
         'hindi':34,
         'science':35,
         'english':96
         }
marks_series = pd.Series(marks,name = 'Marks')
marks_series

maths      65
hindi      34
science    35
english    96
Name: Marks, dtype: int64

## serise attribute

In [17]:
# size

marks_series.size

4

In [18]:
# dtype
marks_series.dtype

dtype('int64')

In [19]:
#name
marks_series.name

'Marks'

In [20]:
# is_unique
marks_series.is_unique

True

In [21]:
marks_series.index

Index(['maths', 'hindi', 'science', 'english'], dtype='object')

In [24]:
run_series.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
# values
marks_series.values

array([65, 34, 35, 96])